//Haunted House
//**Консольные игры**
//(c) Компьютерная академия ШАГ. Воронеж
//(с) Старинин Андрей, Маслякова Диана

#include <iostream>

using namespace std;

int answer;//выбор-продолжить игру или нет
int answer1 = 7;//ответ на первый вопрос
int answer2 = 3;//ответ на второй вопрос
int answer3 = 16;//ответ на третий вопрос
int score = 3;//счетчик количества попыток
int number1;//ввод пользователем первой отгадки
int number2;//ввод пользователем второй отгадки
int number3;//ввод пользователем третьей отгадки

void FirstDoor();//функция первой двери
void SecondDoor();//функция второй двери
void ThirdDoor();//функция третьей двери
void TheEnd();//вывод выигрышного финала

int main()
{
	setlocale(LC_ALL, "ru");
	

	cout << "**Консольные игры**" << endl;
	cout << "(c) Компьютерная академия ШАГ. Воронеж" << endl;
	cout << "(с) Старинин Андрей, Маслякова Диана" << endl;
	cout << endl;

	cout << "\t||    ||" << endl;
	cout << "\t||    ||      *      *    *  *   *  *****  *****  ****" << endl;
	cout << "\t||    ||     * *     *    *  *   *    *    *      *   *" << endl;
	cout << "\t||    ||    *   *    *   **  **  *    *    ****   *    *" << endl;
	cout << "\t||    ||   *******   *  * *  * * *    *    *      *   *" << endl;
	cout << "\t||    ||  *       *  ***  *  *  **    *    *****  ****" << endl;
	cout << "\t||====||" << endl;
	cout << "\t||    ||" << endl;
	cout << "\t||    ||   ***   *    *   ***   *****" << endl;
	cout << "\t||    ||  *   *  *    *  *      *    " << endl;
	cout << "\t||    ||  *   *  *   **   ***   **** " << endl;
	cout << "\t||    ||  *   *  *  * *      *  *" << endl;
	cout << "\t||    ||   ***   ***  *   ***   *****" << endl;
	cout << "\n\n\t" << endl;
	system("pause");	

	system("cls");
	cout << "\n\n\t" << endl;
	cout << "\tВы оказались запертым в старом доме с привидением \n" << endl;
	cout << "\tпрограммиста и, чтобы выбраться оттуда, придётся\n" << endl;
	cout << "\tпотрудиться! Каждую дверь, ведущую к свободе,\n" << endl;
	cout << "\tоткрывает ключ-отгадка на загадку, которая\n" << endl;
	cout << "\tнаписана на этой двери! Вперёд к свободе!\n\n" << endl;
	cout << "\tЕсли ответ будет неправильный, то призрак \n" << endl;
	cout << "\tнападёт на ВАС!\n" << endl;
	cout << "\n\tЕсли готовы начать двигаться к свободе,\n" << endl;
	cout << "\tто нажмите 1\n" << endl;
	cout << "\n\n\t" << endl;
	cin >> answer;

	if (answer == 1)
	{
		FirstDoor();//если выбор играть, то загадка перва

		if (number1 == answer1)
		{
			SecondDoor();//загадка вторая

			if (number2 == answer2)
			{
				ThirdDoor();//загадка третья

				if (number3 == answer3)
				{
					TheEnd();//финал
				}
				else
				{
					cout << "\n\n\tОтвет неверный..." << endl;
					cout << "\n\n\tЩелкая мышкой и стуча по клавиатуре на Вас надвигается привидение..." << endl;
				}
			}

			else
			{
				cout << "\n\n\tОтвет неверный..." << endl;
				cout << "\n\n\tЩелкая мышкой и стуча по клавиатуре на Вас надвигается привидение..." << endl;
			}
		}
		else
		{
			cout << "\n\n\tОтвет неверный..." << endl;
			cout << "\n\n\tЩелкая мышкой и стуча по клавиатуре на Вас надвигается привидение..." << endl;
		}
	}
	else
	{
		cout << "\n\n\t Ну что ж, оставайся сидеть в подвале..." << endl;
	}

}

void FirstDoor()
{
	system("cls");
	cout << "\n\n\tПеред Вами первая дверь,которая выведет Вас из подвала в дом" << endl;
	cout << "\n\n\tВведите отгадку и нажмите enter" << endl;
	cout << "\n\n\t" << endl;
	cout << "\t--------------------------------" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##                         ###|" << endl;
	cout << "\t|##    Я считаю в системе   ###|" << endl;
	cout << "\t|##  счисления отличной от  ###|" << endl;
	cout << "\t|##  десятичной, и вместо   ###|" << endl;
	cout << "\t|##      136 я пишу 253.    ###|" << endl;
	cout << "\t|##    В какой системе      ###|" << endl;
	cout << "\t|##       я считаю?         ###|" << endl;
	cout << "\t|##                         ###|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t--------------------------------" << endl;

	cout << "\n\n\t" << endl;
	cout << "\n\n\t" << endl;

	while (score != 0)//счетчик количества попыток
	{
		cin >> number1;
		score--;
		if (number1 == answer1)
		{
			break;
		}
		cout << "\nВы потратили " << 3 - score << " попыток" << endl;
	}
	score = 3;//обновляем количество попыток
	
}
void SecondDoor()
{
	cout << "\n\n\t Поздравляем! Вы вышли из подвала и поднялись в холл" << endl;
	system("pause");
	system("cls");
	cout << "\n\n\tВы поднялись в холл и перед вами следующая дверь" << endl;
	cout << "\n\n\tВведите отгадку и нажмите enter" << endl;
	cout << "\n\n\t" << endl;
	cout << "\t--------------------------------" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##                         ###|" << endl;
	cout << "\t|##   Эта цифра просто чудо ###|" << endl;
	cout << "\t|##   У нее родня повсюду   ###|" << endl;
	cout << "\t|##   Даже в алфавите есть  ###|" << endl;
	cout << "\t|##   У нее сестра-близнец  ###|" << endl;
	cout << "\t|##                         ###|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t--------------------------------" << endl;

	cout << "\n\n\t" << endl;
	cout << "\n\n\t" << endl;

	while (score != 0)//счетчик количества попыток
	{
		cin >> number2;
		score--;
		if (number2 == answer2)
		{
			break;
		}
		cout << "\nВы потратили " << 3 - score << " попыток" << endl;
	}
	score = 3;//обновляем количество попыток
	
}

void ThirdDoor()
{
	cout << "\n\n\t Поздравляем! Вы вышли из холла и приблизились к входной двери!" << endl;
	system("pause");
	system("cls");
	cout << "\n\n\tВы почти на свободе! Ещё один рывок!" << endl;
	cout << "\n\n\tВведите отгадку и нажмите enter" << endl;
	cout << "\n\n\t" << endl;
	cout << "\t--------------------------------" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##                         ###|" << endl;
	cout << "\t|## Определить чему равен Х ###|" << endl;
	cout << "\t|##       88 ( 32 ) 79      ###|" << endl;
	cout << "\t|##       39 ( 27 ) 78      ###|" << endl;
	cout << "\t|##       53 (  Х ) 71      ###|" << endl;
	cout << "\t|##                         ###|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t|##############################|" << endl;
	cout << "\t--------------------------------" << endl;

	cout << "\n\n\t" << endl;
	cout << "\n\n\t" << endl;

	while (score != 0)//счетчик количества попыток
	{
		cin >> number3;
		score--;
		if (number3 == answer3)
		{
			break;
		}
		cout << "\nВы потратили " << 3 - score << " попыток" << endl;
	}
	
}

void TheEnd()
{
	system("cls");
	cout << "\n\tПоздравляем! Вы вышли на Свободу! Но....\n" << endl;
	cout << "\n\tПока вы выбирались из подвала дома с привидением\n" << endl;
	cout << "\n\tпроизошёл Зомби Апокалипсис!\n" << endl;
	cout << "\n\tИ теперь стоит задуматься, стоило ли выходить...!?)\n" << endl;

	cout << "\n\t\n" << endl;
	cout << "\n\t\n" << endl;
	cout << "\n\t\n" << endl;

	cout << "              ****  **             " << endl;
	cout << "         *** *    *   *            " << endl;
	cout << "       *    *    **   *            " << endl;
	cout << "      **    *    *   *   ***       " << endl;
	cout << "     *  *   *    *  *   *  *       " << endl;
	cout << "     *   *   *   *  *  *    *      " << endl;
	cout << "      *    *  *  *  * *    *       " << endl;
	cout << "       *   *  *   *  *    *        " << endl;
	cout << "        *     *   *      *         " << endl;
	cout << "         *              *     **   " << endl;
	cout << "          *            *      **   " << endl;
	cout << "           *          *    ********" << endl;
	cout << " **         *        *     ********" << endl;
	cout << "  **   **     *       *       **   " << endl;
	cout << "   * *  **    *       *       **   " << endl;
	cout << "** ********   * ****  *   ** ***** " << endl;
	cout << "********  *******  *************** " << endl;
	cout << "****          *        * *         " << endl;
	cout << "\n\t\n" << endl;
	cout << "\n\t\n" << endl;
	cout << "\n\t\n" << endl;
	
}
